---
kind: property
id: P:Autodesk.Revit.DB.Revolution.EndAngle
source: html/266e7232-7f9d-471f-c3ce-9049b2d69b1d.htm
---
# Autodesk.Revit.DB.Revolution.EndAngle Property

The end angle of the revolution relative to the sketch plane.

## Syntax (C#)
```csharp
public double EndAngle { get; set; }
```

## Remarks
The direction of the angle is based on the normal of the sketch plane.
A positive angle is on the same side as the normal, a negative angle on the opposite side.